app/controllers/games_controller.rb

  def create
    @random= rand(1..100)
    @current_user= 1
    @game = Game.create!({song_id: @random, user_id: @current_user, score: 0})
---
INSERT INTO "games" ("song_id", "user_id", "score", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["song_id", 76], ["user_id", 1], ["score", 0], ["created_at", "2015-03-25 23:44:26.684746"], ["updated_at", "2015-03-25 23:44:26.684746"]]

  def try1
    @game = Game.find(params[:id])
---
SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT 1  [["id", 3]]

  def try2
  @game = Game.find(params[:id])
---
SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT 1  [["id", 6]]

  def final
     @game = Game.find(params[:id])
---
SELECT  "games".* FROM "games" WHERE "games"."id" = $1 LIMIT 1  [["id", 7]]